programming/misc/stack.org
#+SETUPFILE: ../../styles/readtheorg.setup
#+TITLE: Stack

* Network

#+ATTR_HTML: :class no-border
| [[http://twitter.github.io/finagle/][*Finagle*]] | Network stack for JVM to build asynchronous RPC clients and servers in Java, Scala. |
|           | Used to construct high-concurrency servers.                                         |
|           | Written in Scala, provides both Scala and Java idiomatic APIs.                      |
|           | Provides a rich set of protocol-independent tools.                                  |

** Message-oriented middleware

#+ATTR_HTML: :class no-border
| *Apache ActiveMQ* |                                                                                                     |
|-------------------+-----------------------------------------------------------------------------------------------------|
| [[https://kafka.apache.org/][*Apache Kafka*]]    | Message broker written in Scala.                                                                    |
|                   | Provides a unified, high-throughput, low-latency platform for handling real-time data feeds.        |
|                   | A massively scalable pub/sub message queue architected as a distributed transaction log.            |
|                   | Used for enterprise infrastructures to process streaming data.                                      |
|-------------------+-----------------------------------------------------------------------------------------------------|
| [[http://gearman.org/][*Gearman*]]         | Application framework designed to distribute computer tasks to multiple computers or processes.     |
|                   | Allows to do work in parallel, to load balance processing, and to call functions between languages. |
|                   | Nervous system for how distributed processing communicates.                                         |
|-------------------+-----------------------------------------------------------------------------------------------------|
| *Kestrel*         |                                                                                                     |
|-------------------+-----------------------------------------------------------------------------------------------------|
| *MemcacheQ*       |                                                                                                     |
|-------------------+-----------------------------------------------------------------------------------------------------|
| *Netty*           |                                                                                                     |
|-------------------+-----------------------------------------------------------------------------------------------------|
| *RabbitMQ*        |                                                                                                     |

* Provision

#+ATTR_HTML: :class no-border
| *Ansible* |   |
|-----------+---|
| *Puppet*  |   |
|-----------+---|
| *Salt*    |   |
* CI

| [[https://travis-ci.org/][Travis CI]] |   |
|-----------+---|
|           |   |

