programming/architecture/stack.html
---
title: "Stack"
---
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-11-25 Sun 20:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Stack</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Victor Chen" />
<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/font.css"/>
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/htmlize.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Stack</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf503d9c">1. Network</a>
<ul>
<li><a href="#orgaf489e1">1.1. Message-oriented middleware</a></li>
</ul>
</li>
<li><a href="#org63f2da0">2. Provision</a></li>
<li><a href="#org9634b65">3. CI</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgf503d9c" class="outline-2">
<h2 id="orgf503d9c"><span class="section-number-2">1</span> Network</h2>
<div class="outline-text-2" id="text-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" class="no-border">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="http://twitter.github.io/finagle/"><b>Finagle</b></a></td>
<td class="org-left">Network stack for JVM to build asynchronous RPC clients and servers in Java, Scala.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Used to construct high-concurrency servers.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Written in Scala, provides both Scala and Java idiomatic APIs.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Provides a rich set of protocol-independent tools.</td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-orgaf489e1" class="outline-3">
<h3 id="orgaf489e1"><span class="section-number-3">1.1</span> Message-oriented middleware</h3>
<div class="outline-text-3" id="text-1-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" class="no-border">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><b>Apache ActiveMQ</b></th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><a href="https://kafka.apache.org/"><b>Apache Kafka</b></a></td>
<td class="org-left">Message broker written in Scala.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Provides a unified, high-throughput, low-latency platform for handling real-time data feeds.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">A massively scalable pub/sub message queue architected as a distributed transaction log.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Used for enterprise infrastructures to process streaming data.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><a href="http://gearman.org/"><b>Gearman</b></a></td>
<td class="org-left">Application framework designed to distribute computer tasks to multiple computers or processes.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Allows to do work in parallel, to load balance processing, and to call functions between languages.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Nervous system for how distributed processing communicates.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><b>Kestrel</b></td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><b>MemcacheQ</b></td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><b>Netty</b></td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><b>RabbitMQ</b></td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-org63f2da0" class="outline-2">
<h2 id="org63f2da0"><span class="section-number-2">2</span> Provision</h2>
<div class="outline-text-2" id="text-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" class="no-border">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><b>Ansible</b></th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b>Puppet</b></td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><b>Salt</b></td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org9634b65" class="outline-2">
<h2 id="org9634b65"><span class="section-number-2">3</span> CI</h2>
<div class="outline-text-2" id="text-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><a href="https://travis-ci.org/">Travis CI</a></th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Victor Chen</p>
<p class="date">Created: 2018-11-25 Sun 20:38</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
